package com.xingfeng.exer1.array;

/**
 * 在一个无序数组红查找最小的k个数，并且顺序与原数组中元素顺序一致
 * Created by Xingfeng on 2016/4/14.
 */
public class KthNumbers {

    public int[] findKthNumbers(int[] A, int n, int k) {

        if (k > n)
            return null;

        int[] result = new int[k];

        for (int i = 0; i < k; i++) {
            result[i] = A[i];
        }

        for (int i = k; i < A.length; i++) {

            int index = findMaxInArray(result);
            if (A[i] < result[index]) {
                for(int j=index+1;j<k;j++){
                    result[j-1]=result[j];
                }
                result[k-1]=A[i];
            }
        }

        return result;
    }

    /**
     * 查找数组中最大元素的索引
     *
     * @param result
     * @return
     */
    private int findMaxInArray(int[] result) {

        int index = 0;
        int max = result[0];
        for (int i = 1; i < result.length; i++) {
            if (result[i] > max) {
                max = result[i];
                index = i;
            }
        }
        return index;
    }

    public static void main(String[] args) {

        int[] array={50043,64313,24321,3995,24715,56933,22117,16507,56129,
                12035,53933,13630,36298,51529,19599,2906,57734,41062,
                78723,36944,71224,5025,65290,8970,54197,84156,76214,2376,
                69193,5971,63630,54915,9239,44834,46689,28069,64742,83918,
                16651,70161,70237,59879,78171,76171,23409,61887,66584,47678,
                74801,27535,50861,33175,37835,33080,9163,62231,34019,28842,82587
                ,59235,45609,67675,83635,75303,43445,57381,63173,57306,31963,69817
                ,14681,75207,78704,14349,39097,3874,71779,11258,20952,74002,61140,
                61169,49894,1280,74628,11829,66108,20452,42842,68887,22427,83055,
                51511,52598,7247,67255,4978,29370,10202,77198,31017,1723,34631,
                68303,8091,7052,25686,37486,26232,6116,25243,81144,84706,43203,
                81913,58339,29857,39543,62232,12825,2896,26959,38332,3728,42276,
                77002,57185,44191,66238,64650,17245,52076,14911,73641,41869,39972
                ,681,46420,79377,49765,48249,59314,48854,72131,35357,11116,64832,
                73093,40174,15510,18015,72523,4300,32295,21486,53542,67697,55131
                ,7721,13200,20997,60719,71002,18825,80246,60548,30838,30780,64575};


        KthNumbers demo=new KthNumbers();
        int[] result=demo.findKthNumbers(array,170,103);

        int i=0;
    }
}
